snlkuharlocal/src/Documents/УПД/УПД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УПД</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПередачаКодовМаркировкиМП</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСовсемБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСпособаВыставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУПД</name>
    <type>
      <types>EnumRef.ТипУПД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлXML</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПередачаКодовМаркировкиМП</types>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУПД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУПД/ТипУПД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУПД</name>
  <enumValues>
    <name>СЧФДОП</name>
  </enumValues>
  <enumValues>
    <name>СЧФ</name>
  </enumValues>
  <enumValues>
    <name>ДОП</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/УсловияОплаты/УсловияОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияОплаты</name>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Отсрочка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/УПД/ObjectModule.bsl
Процедура РасчетИтогов() Экспорт
	СуммаБезНДС18		=0;
	НДС18				=0;
	СуммаБезНДС10		=0;
	НДС10				=0;
	СуммаСовсемБезНДС	=0;
	
	Если ДокОснование<>Неопределено И НЕ  ДокОснование.Пустая() Тогда
		ТабСтавок= ДокОснование.Товары.Выгрузить();
		ТабСтавок.Свернуть("СтавкаНДС","Всего,НДС");	
		
		Всего=ТабСтавок.Итог("Всего");		
		
		Для Каждого СтрокаСтавок Из ТабСтавок Цикл
				Если СтрокаСтавок.СтавкаНДС	= Перечисления.СтавкиНДС.НДС18 ИЛИ СтрокаСтавок.СтавкаНДС	= Перечисления.СтавкиНДС.НДС20 Тогда
								СуммаБезНДС18	= СтрокаСтавок.Всего-СтрокаСтавок.НДС;								
				НДС18			= СтрокаСтавок.НДС;			
			ИначеЕсли СтрокаСтавок.СтавкаНДС=Перечисления.СтавкиНДС.НДС10 Тогда
				СуммаБезНДС10	= СтрокаСтавок.Всего-СтрокаСтавок.НДС;								
				НДС10			= СтрокаСтавок.НДС;			
			ИначеЕсли СтрокаСтавок.СтавкаНДС= Перечисления.СтавкиНДС.БезНДС ИЛИ СтрокаСтавок.СтавкаНДС= Перечисления.СтавкиНДС.НДС0 Тогда
	
				СуммаСовсемБезНДС	= СтрокаСтавок.Всего;			
			КонецЕсли;			
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Функция КонтрольДублейСФ(СФОбъект,Отказ,Дубли=Неопределено) Экспорт	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	УПД.Ссылка КАК Ссылка,
	             |	УПД.ДокОснование КАК ДокОснование
	             |ИЗ
	             |	Документ.УПД КАК УПД
	             |ГДЕ
	             |	УПД.ПометкаУдаления = ложь
	             |	И УПД.ДокОснование = &докОсн
				 |	И Ссылка <> &Ссылка
				 |	И Ссылка.Организация = &Организация";
	
	
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Ссылка КАК СФ,
	//|	Накладная
	//|ИЗ
	//|	Документ.УПД КАК СчетФактураНакладные
	//|ГДЕ
	//|	Накладная В(&Накладные)
	//|	И НЕ Ссылка.ПометкаУдаления
	//|	И Ссылка <> &Ссылка
	//|	И Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДокОсн",СФОбъект.ДокОснование);
	Запрос.УстановитьПараметр("Ссылка",СФОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация",СФОбъект.Организация);
	
	ЕстьДубли=Ложь;	
	
	Дубли=Новый Массив;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("На накладную: "+Выборка.ДокОснование+", по организации: """+СФОбъект.Организация+"""
		|	уже выписана СФ: "+Выборка.Ссылка,СтатусСообщения.Важное);		
		ЕстьДубли=Истина;	
		
		Дубли.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если НЕ Отказ И ЕстьДубли Тогда
		Отказ=Истина;
	КонецЕсли;	
	
	Возврат НЕ ЕстьДубли;
КонецФункции //КонтрольДублейСФ(СФОбъект,Отказ)


//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		//Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		////	Отказ=НЕ ПолучитьПолномочиеПользователя("ВыпискаСФвОфисе");
		//	
		//	// Кухарь А.Ю. 08.04.2022 начало
		//	// Чтобы не создавали СФ по накладным с реальных складов других подразделений
		//	если не Отказ и ЭтоНовый() тогда
		//		если ЗначениеЗаполнено(Склад.КодФизическогоУзла) и Склад.КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код тогда
		//			Отказ=Истина;
		//		КонецЕсли;
		//	КонецЕсли;
		//	// Кухарь А.Ю. 08.04.2022 конец
		//	
		//	Если Отказ Тогда
		//		Сообщить("Недостаточно полномочий для оформления СФ в офисной базе !",СтатусСообщения.Важное);			
		//	КонецЕсли;		
		//КонецЕсли;
		
		
	//	//крохин начало 16.02.2012
	////запретим редактировать филиальные СФ в офисе и офисные - в филиале
	//Если  НЕ ОбменДанными.Загрузка Тогда
	//	Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//		Если Склад.ТипСклада = Перечисления.ТипСклада.Филиал ИЛИ Склад.ТипСклада = Перечисления.ТипСклада.ОптовыйТЦ Тогда
	//			#Если КЛИЕНТ Тогда
	//				сообщить("СФ по складу "+Склад + " редактируются только в соответствующем подразделении");
	//			#КОНЕЦЕСЛИ	
	//			Отказ = Истина;	
	//			
	//		КонецЕсли;
	//	ИначеЕсли ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
	//		//крохин начало 11.04.2013
	//		//СФ можно редактировать только свои
	//		//Если Склад.ТипСклада <> Перечисления.ТипСклада.Филиал И Склад.ТипСклада <> Перечисления.ТипСклада.ОптовыйТЦ Тогда
	//		Если Склад.Подразделение <> ПараметрыСеанса.ЭтотУзел.Подразделение Тогда
	//		//крохин конец 11.04.2013
	//			#Если КЛИЕНТ Тогда
	//				сообщить("СФ по складу "+Склад + " редактируются только в офисе");
	//			#КОНЕЦЕСЛИ	
	//			Отказ = Истина;	
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////крохин конец 16.02.2012

		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		КонтрольДублейСФ(ЭтотОбъект,Отказ);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	//Если ЕстьИзменения Тогда		
	//	СуммаБезНДС18		=Накладные.Итог("СуммаБезНДС18");
	//	НДС18				=Накладные.Итог("НДС18");
	//	СуммаБезНДС10		=Накладные.Итог("СуммаБезНДС10");
	//	НДС10				=Накладные.Итог("НДС10");
	//	СуммаСовсемБезНДС	=Накладные.Итог("СуммаСовсемБезНДС");
	//	Всего				=СуммаБезНДС18+НДС18+СуммаБезНДС10+НДС10+СуммаСовсемБезНДС;
	//	
	//	Для Каждого СтрокаТЧ Из Накладные Цикл
	//		Если ЗначениеЗаполнено(СтрокаТЧ.Накладная.Номер) Тогда
	//			Если СтрокаТЧ.Накладная.Метаданные().Имя="Перемещение" Тогда
	//				Контрагент=ПолучитьКонтрагентаСклада(СтрокаТЧ.Накладная.СкладПолучатель);						
	//			Иначе
	//				Контрагент=СтрокаТЧ.Накладная.Контрагент;
	//			КонецЕсли;		
	//			
	//			Прервать;			
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
		
	
КонецПроцедуры




Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	//Если НЕ ОбменДанными.Загрузка Тогда
	//	Для Каждого СтрокаНакладной Из Накладные Цикл
	//		Накладная=СтрокаНакладной.Накладная;
	//		Если Накладная<>Неопределено И НЕ Накладная.Пустая() И Накладная.Метаданные().Имя="Чек" И ЗначениеЗаполнено(Накладная.Номер) Тогда
	//			Отказ=Не УстановитьПометкуЧека(Накладная,Истина);				
	//		КонецЕсли; 				
	//	КонецЦикла; 				
	//КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
//	Если НЕ ОбменДанными.Загрузка Тогда
//		Для Каждого СтрокаНакладной Из Накладные Цикл
//			Накладная=СтрокаНакладной.Накладная;
//			Если Накладная<>Неопределено И НЕ Накладная.Пустая() И Накладная.Метаданные().Имя="Чек" Тогда
//				Отказ=Не УстановитьПометкуЧека(Накладная,Ложь);
//			КонецЕсли; 				
//		КонецЦикла; 				
//	КонецЕсли;
//		//крохин начало
//	Для Каждого СтрокаНакладной Из Накладные Цикл
//	Накладная=СтрокаНакладной.Накладная;
//	Если Накладная<>Неопределено И ЕстьРеквизитДокумента("СостояниеДокументов",Накладная.Метаданные()) Тогда
//	НакладнаяОбъект = Накладная.ПолучитьОбъект();
//	//крохин начало 15.04.2013
//	//НакладнаяОбъект.СостояниеДокументов = Перечисления.СостояниеДокументов.НеВыписаны;
//	//НакладнаяОбъект.Записать(РежимЗаписиДокумента.Запись);
//	НакладнаяОбъект.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.НеВыписаны,Неопределено,Истина);
//	//крохин конец 15.04.2013
//КонецЕсли ;
//		КонецЦикла; 	
//	//крохин конец

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание.кодОперации =перечисления.КодыОперацийОстатки.Реализация ТОгда
		СФ = СФНакладной(Основание);
		Если НЕ СФ.пустая() Тогда
			НомерУПД = СФ.Номер;
		Иначе
			сообщить("Для РНК не существует документа СФ, просьба создать.");
			возврат;
		КонецЕсли;
	конецЕсли;
	
	ВидОснования = Основание.Метаданные().Имя;
	
	ИБ			 = Основание.ИБ; 
	
	Если ВидОснования = "РасходнаяНакладная" Тогда				
		Контрагент   = Основание.Контрагент;
		Договор 	 = Основание.Договор;		
		
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		ДокОснование = Основание;
		ТипУПД = Перечисления.ТипУПД.СЧФДОП;
		
		// если комиссия, то тип УПД - ДОП
		Если договор.условияОплаты = перечисления.УсловияОплаты.Комиссия
			или Основание.кодОперации =перечисления.КодыОперацийОстатки.Комиссия 
		ТОгда
		
			ТипУПД = Перечисления.ТипУПД.доп;
		
		КонецЕсли;
		
		НомерУПД = Основание.Номер;
		ДатаУПД = Основание.Дата;

		Если Основание.кодОперации =перечисления.КодыОперацийОстатки.Реализация ТОгда
			СФ = СФНакладной(Основание);
			Если НЕ СФ.пустая() Тогда
				НомерУПД = СФ.Номер;
			Иначе
				сообщить("Для РНК не существует документа СФ, просьба создать.");
				возврат;
			КонецЕсли;
			
		ИначеЕсли Основание.кодОперации =перечисления.КодыОперацийОстатки.АгентскийДоговор  ТОгда
			
			НомерУПД = Основание.Номер;	
			
			
		КонецЕсли;			
		
		
	КонецЕсли;	
	
	// нечаева 06,11,24+++
	Если ВидОснования = "ПередачаКодовМаркировкиМП" Тогда				
		Контрагент   = Основание.Контрагент;
		Договор 	 = Основание.Договор;		
		
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		ДокОснование = Основание;
		ТипУПД = Перечисления.ТипУПД.СЧФДОП;
		
		// если комиссия, то тип УПД - ДОП
		Если договор.условияОплаты = перечисления.УсловияОплаты.Комиссия
			или Основание.кодОперации =перечисления.КодыОперацийОстатки.Комиссия 
		ТОгда
		
			ТипУПД = Перечисления.ТипУПД.доп;
		
		КонецЕсли;
		
		НомерУПД = Основание.Номер;
		ДатаУПД = Основание.Дата;
		
		
		// пока сделали для всех контрагентов, из номера акта приемки.
		Если  СокрЛП(Основание.НомерАктаПриемки)<>"" Тогда
			ДатаУПД= Основание.ДатаАктаПриемки;
			НомерУПД = Основание.НомерАктаПриемки;
			ТипУПД = перечисления.ТипУПД.ДОП;
		КонецЕсли;
			
		
		
	КонецЕсли;
	// нечаева 06,11,24---
	
	
	
	
	
	
	
	Если ВидОснования = "РасходнаяНакладная" И ЗначениеЗаполнено(Основание.ДатаОтгрузки) И НачалоДня(Основание.ДатаОтгрузки)>НачалоДня(Основание.Дата) Тогда
		Дата=Основание.ДатаОтгрузки;		
	Иначе
		СдвигДаты=ПолучитьЗначениеПоУмолчанию("СдвигатьДатуСФ");
		Если СдвигДаты<>Неопределено Тогда
			Дата=Основание.Дата+СдвигДаты*24*60*60;		
		КонецЕсли;
	КонецЕсли;	
	
	РасчетИтогов();
	
КонецПроцедуры
